package assets

var HangmanStages = [6]string{
	// 0 ошибок — пустая виселица
	" +---+   \n" +
		" |   |   \n" +
		"     |   \n" +
		"     |   \n" +
		"     |   \n" +
		"     |   \n" +
		"=========",

	// 1 ошибка — голова
	" +---+   \n" +
		" |   |   \n" +
		" O   |   \n" +
		"     |   \n" +
		"     |   \n" +
		"     |   \n" +
		"=========",

	// 2 ошибки — голова + туловище
	" +---+   \n" +
		" |   |   \n" +
		" O   |   \n" +
		" |   |   \n" +
		"     |   \n" +
		"     |   \n" +
		"=========",

	// 3 ошибки — голова + туловище + одна рука
	" +---+   \n" +
		" |   |   \n" +
		" O   |   \n" +
		"/|   |   \n" +
		"     |   \n" +
		"     |   \n" +
		"=========",

	// 4 ошибки — голова + туловище + две руки
	" +---+   \n" +
		" |   |   \n" +
		" O   |   \n" +
		"/|\\  |   \n" +
		"     |  \n" +
		"     |  \n" +
		"=========",

	// 5 ошибок — всё тело, игра окончена
	" +---+   \n" +
		" |   |   \n" +
		" x   |   \n" +
		"/|\\  |   \n" +
		"/ \\  |   \n" +
		"         \n" +
		"=========",
}

const Divider = "══════════════════════════════"

const (
	MsgLivesLeft = "жизней: %d"
	MsgUsed      = "использованные буквы:"
)

const (
	MsgPromptMenu  = "Введите цифру: "
	MsgPrompt      = "Введите букву: "
	MsgAlreadyUsed = "! Буква уже была, попробуйте другую"
	MsgWrongInput  = "! Только буква, только одна"
)

const (
	MsgWin  = "🎉  Вы угадали слово!"
	MsgLose = "💀  Вы проиграли. Загаданное слово: %s"
)

const (
	MenuNewGame = "Новая игра"
	MenuExit    = "Выйти"
)
